<?php

return [
    'main' => [
        'slogan' => 'Допоможе вивчити будь-яку мову', // Поможет изучить любой язык
        'languages' => 'Мови', // Языки
        'training' => 'Тренування', // Тренировка
        'statistics' => 'Статистика', // Статистика
        'favorite' => 'Обране', // Избранное
        'search' => 'Пошук', // Поиск
        'start_to_find' => 'Заповніть форму і натисніть Пошук', // Заполните форму и нажмите Найти
        'Search_language' => 'Мова пошуку', // Язык поиска
        'copyright' => 'Усі права захищені', // Все права защищены
        'words' => 'Слів', // Слов
        'added' => 'Додано', // Добавлено
        'repeated' => 'Повторено', // Повторено
        'read' => 'Прочитано', // Прочитано
        'main' => 'Головна', // Главная
        'easy' => 'Легкий', // 'Легкий'
        'medium' => 'Середній', // 'Срединй'
        'hard' => 'Складний', // 'Сложный'

        'cancel' => 'Скасувати', // 'Отмена'
        'delete' => 'Видалити', // 'Удалить'
        'change' => 'Змінити', // 'Изменить'
        'save' => 'Зберігти', // 'Сохранить'
        'go_editing' => 'Перейти в редагування', // Перейти в редактирование
    ],
    'auth' => [
        'email' => 'Email', // Email
        'login' => 'Вхід', // Вход
        'register' => 'Реєстрація', // Регистрация
        'logout' => 'Выхід з акаунту', // Выход из аккаунта
        'forgot_pass' => 'Забули свій пароль?', // Забыли свой пароль?
        'remember' => 'Запам\'ятати мене', // Запомнить меня
        'password' => 'Пароль', // Пароль
        'name' => 'Им\'я', // Имя
        'confirmed' => 'Подтвердіть пароль', // Подтвердите пароль
    ],
    'home' => [
        'success_today' => 'Успіхи за сьогодні', //'Успехи за сегодня'
        'phrases_added' => 'Фраз додано', //'Фраз добавлено'
        'new_words_added' => 'Нових слів додано', //'Новых слов добавлено'
        'repeated' => 'Повторено', //'Повторено'
        'read' => 'Прочитано', //'Прочитано'
        'time_to_study' => 'Часу на навчання затрачено (г:х:с)', //'Времени на обучение затрачено (ч:м:с)'
        'hello' => 'Привіт', //'Привет'
        'languageDefault' => 'У вас назначено мову за замовчуванням', //'У вас назначен язык по умолчанию'
        'noLanguageDefault' => 'У вас не назначено мову за замовчуванням', //'У вас не назначен язык по умолчанию'
        'changeLanguageDefault' => 'Змінити мову за замовчуванням', //'Изменить язык по умолчанию'
        'setLanguageDefault' => 'Призначити мову за замовчуванням', //'Назначить язык по умолчанию'
        'no_any_languages' => "У вас нема поки жодної вивчаємої мови", //'У вас нет пока ни одного изучаемого языка'
        'add_language' => "Додати мову", //'Добавить язык'
        'set' => "Встановити", //'Установить'
        'close' => "Закрити", //'Закрыть'
        'change_and_close' => "Виберіть мову і написніть Примінити", //'Выберите язык и нажмите применить'
        'last_added_sections' => "Останні додані розділи", //'Последние добавленные разделы'
        'last_repeated_sections' => "Останні повторені розділи", //'Последние повторенные разделы'
        'last_read_sections' => "Останні прочитані розділи", //'Последние прочитанные разделы'
        'last_added_phrases' => "Останні додані фрази", //'Последние добавленные фразы'
    ],
    'languages' => [
        'add_language' => 'Додати мову', // 'Добавить язык'
        'lang_studies' => 'Вивчаємі мови', // 'Изучаемые языки'
        'add_lang' => 'Додавання вивчаємої мови', // 'Добавление изучаемого языка'
        'lang_name' => 'Назва мови', // 'Название языка'
        'add' => 'Додати', // 'Добавить'
        'cancel' => 'Скасувати', // 'Отмена'
        'view_fav' => 'Подивитись Обране', // 'Посмотреть избранное'
        'add_sec' => 'Додати розділ', // 'Добавить раздел'
    ],
    'sections' => [
        'sections' => 'Розділи', // 'Разделы'
        'add_sect' => 'Додавання розділу', // 'Добавление раздела'
        'sect_name' => 'Назва розділу', // 'Название раздела'
        'comment' => 'Коментар, опис', // 'Комментарий, описание'
        'add_sec' => 'Додати', // 'Добавить'
        'edit' => 'Редагувати', // 'Редактировать'
        'add_edit_phrases' => 'Додати/редагувати фрази', // 'Добавить/редактировать фразы'

        'count_cycles' => 'К-сть циклів', // 'К-во циклов'
        'diff_level' => 'Рівень складності', // 'Уровень сложности'
        'all' => 'Всі', // 'Все'
        'easy' => 'Легкий', // 'Легкий'
        'medium' => 'Середній', // 'Средний'
        'hard' => 'Складний', // 'Сложный'
        'medium_and_hard' => 'Складний і середній', // 'Сложный и средний'
        'sorting' => 'Сортування', // 'Сортировка'
        'in_order' => 'За порядком', // 'По порядку'
        'by_chance' => 'Випадково', // 'Случайно'
        'task' => 'Задача', // 'Задача'
        'learn' => 'Вчити', // 'Учить'
        'read' => 'Читати', // 'Читать'
        'limit' => 'Ліміт', // 'Лимит'

        'deselect' => 'Зняти/додати виділення у всіх', // 'Снять/добавить выделение у всех'
        'select_deselect' => 'Знімає або додає виділення у всого розділу', // 'Снимает или добавляет выделение у всего раздела'
        'select_deselect_entire' => 'Зняти/додати выділення для всього розділу', // 'Снять/добавить выделение для всего раздела'
        'phrase_deselected' => 'Фрази, у яких зняте выділення (галочка у чекбоксі) не попадають у вправи по написанню або по читанню', // 'Фразы, у которых снято выделение (галочка в чекбоксе) не попадают в упраждения по написанию или по чтению'
        'add_selection' => 'Додати выділення', // 'Добавить выделение'
        'deselect_all' => 'Зняти виділення в усіх', // 'Снять выделение у всех'
        'section_editing' => 'Редагування розділу', // 'Редактирование раздела'
        'parent_category' => 'Батьківська категорія', // 'Родительская категория'
    ],
    'phrases' => [
        'adding_phrases' => 'Додавання фраз', // 'Добавление фраз'
        'adding_sec_phrases' => 'Додавання фраз розділу', // 'Добавление фраз раздела'
        'transcription' => 'Транскрипція', // 'Транскрипция'
        'native_language' => 'Рідна базова мова', // 'Родной базовый язык'
        'add' => 'Додати', // 'Добавить'
        'back_section' => 'Вернутись у розділ', // 'Вернуться в раздел'
        'delete_all' => 'Видалити усі фрази', // 'Удалить все фразы'
        'phrase_editing' => 'Редагування фрази', // 'Редактирование фразы'
        'basis_information' => 'Основні відомості', // Основные сведения
        'added' => 'Додано', // Добавлено
        'changed' => 'Змінено (вчилось)', // Изменено (училось)
        'repeated' => 'Повторено раз', // Повторено раз
        'read' => 'Прочитано раз', // Прочитано раз
        'deleting' => 'Видалення фрази', // Удаление фразы
        'are_you_sure' => 'Ви впевнені, что хочете видалити фразу', // Вы уверены, что хотите удалить фразу
        'delete_all_phrases' => 'Видалення усіх фраз з розділу', // Удаление всех фраз из раздела
        'confirmed_delete' => 'Ви впевнені, що хочете видалити усі фрази з розділу', // Вы уверены, что хотите удалить все фразы из раздела
    ],
    'train' => [
        'home' => 'Головна', // Главная
        'train' => 'Тренування', // Тренировка
        'language' => 'Мова', // Язык
        'selection' => 'Вибірка', // Выборка
        'min' => 'Мінімум повторено', // Минимум повторено
        'max' => 'Максимум повторено', // Максимум повторено
        'latest' => 'Останні', // Последние
        'first' => 'Перші', // Первые
        'rand' => 'Випадково', // Случайные
        'count' => 'Кількість', // Количество
        'offset' => 'Зміщенння', // Смещение
        'find' => 'Знайти', // Найти
        'search_results' => 'Результати пошуку', // Результаты поиска
        'exercise' => 'Вправа', // Упражнение
        'generate' => 'Сгенеровано :count строчок', // Сгененировано 40 строк
        'train_in_section' => 'Навчання по розділу', // Обучение по разделу
        'read_exercise' => 'Вправа по читанню', // Упражнение по чтению
        'read_in_section' => 'Читання за розділом', // Чтение по разделу
        'read_in_word' => 'Читання по слову', // Чтение по слову
        'learn_in_word' => 'Навчання по слову', // Обучение по слову
    ],
    'dict' => [
        'new_words_to_today' => 'Нові слова за сьогодня', // Новые слова за сегодня
        'all_vocabulary' => 'Увесь словниковий запас', // Весь словарный запас
        'count_new_words_today' => 'Сьогодні додано нових слів', // Сегодня добавлено новых слов
        'edit_word' => 'Редагувати слово', // Редактировать слово
        'phrases_with_the_word' => 'Фрази зі словом', // Фразы со словом
        'delete_word' => 'Видалити слово ', // Удалить слово
        'deleting_word' => 'Видалення слова', // Удаление слова
        'search_by_word' => 'Пошук за словом', // Поиск по слову
        'back' => 'Назад', // Назад
    ],
    'statistic' => [
        'statistic' => 'Статистика', // Статистика
        'lag_lern_stat' => 'Статистика вивчення мов', // Статистика изучения языков
        'total_count_phrases' => 'Загальна кількість фраз', // Общее количество фраз
        'added_today' => 'Додано сьогодні', // Добавлено сегодня
        'repeated_today' => 'Повторено сьогодні', // Повторено сегодня
        'repeated' => 'Повторено раз', // Повторено раз
        'read' => 'Прочитано раз', // Прочитано раз
        'read_today' => 'Прочитано сьогодні', // Прочитано сегодня
        'vocabulary' => 'Словниковий запас', // Словарный запас
        'total_time' => 'Загальна кількість часу на вивчення', // Общее количество времени на изучение
        'time_today' => 'Сьогодні часу потрачено', // Сегодня времени потрачено
        'adding_new_phrases' => 'додавання нових фраз', // добавления новых фраз
        'adding_new_words' => 'додавання нових слів', // добавления новых слов
        'repetition_of_phrases' => 'повторения фраз', // повторения фраз
        'reading_of_phrases' => 'читання фраз', // чтения фраз
        'progressive_graph' => 'Прогресивный графік :words1 за :period останніх днів', // Прогрессивный график .. за .. последних дней
        'progressive_graph_time' => 'Прогресивний графік затраченого часу за :period останніх днів', // Прогрессивный график затраченного времени за .. последних дней
        'graph_time' => 'Графік затраченого часу за :period останніх днівй', // График затраченного времени за .. последних дней
        'graph' => 'Графік :words1 за :period останніх днів', // График .. за .. последних дней
        'statistic_for_period' => 'Статистика :words1 і :words2 за :period останніх днів', // Статистика .. и .. за .. последних дней
        'statistic_time_for_period' => 'Статистика затраченого часу за :period останніх днів', // Статистика затраченного времени за .. последних дней
        'progressive_graph_all' => 'Прогресивний графік :words1 за весь час навчання', // Прогрессивный график .. за все время изучения
        'progressive_graph_time_all' => 'Прогресивний графік затраченого часу за весь час навчання', // Прогрессивный график затраченного времени за все время изучения
        'graph_time_all' => 'Графік затраченого часу за весь час навчання', // График затраченного времени за все время изучения
        'graph_all' => 'Графік :words1 за весь час навчання', // График .. за все время изучения
        'statistic_all' => 'Статистика :words1 і :words2 за весь час навчання', // Статистика .. за все время изучения
        'statistic_all_time' => 'Статистика затраченого часу за весь час навчання', // Статистика затраченного времени за все время изучения
        'diagram_for_n_days' => 'Графік за :n днів', // График за .. дней
        'graph_repetition_and_reading' => 'Графік повторення і читання', // График повторения и чтения
        'phrase_graph' => 'Графік фраз і слів', // График фраз и слов
        'time_spent_n' => 'Затрати часу за :n днів', // Затраты времени за n.. дней
        'for_all_time' => 'За весь час', // За все время
        'more_days' => 'Ще за :n днів', // Еще за n дней
        'per_day_time' => 'В середньому в день часу', // В среднем в день времени
    ],
    'favorite' => [
        'count_lines' => 'У вас в Обраному :n речень', // У вас в избранном 3 предложений
        'display_default' => 'В даном розділі відображаються тільки ті речення, які входять в мову за замовчуванням', // В данном разделе отображаются только те предложения, которые входят в язык по умолчанию
        'you_have_default' => 'У вас призначено мову за замовчуванням', // У вас назначен язык по умолчанию
        'you_dont_have_default' => 'У вас не призначено мову за замовчуванням', // У вас не назначен язык по умолчанию
        'you_can_change' => 'Вы можете змінити вашу пову за замовчуванням', // Вы можете изменить ваш язык по умолчанию
        'set_default_lagn' => 'Призначити мову за замовчуванням', // Назначить язык по умолчанию
        'clear' => 'Очистити Обране', // Очистить избранное
        'delete_all_sentence' => 'Видалити усі речення з Обраного (ці фрази лишаться у розділах)', // Удалить все предложения из избранного (эти фразы останутся в разделах)
        'here_can_clear' => 'Тут ви можете очистити Обране одним кликом. Фрази будуть видалені з Обраного, але лишаться в тих самих розділах', // Здесь вы можете очистить избранное одним кликом. Фразы будут удалены из избранного, но останутся в тех же разделах
    ],
];














