<?php

return [
    'main' => [
        'slogan' => 'Поможет изучить любой язык', // Поможет изучить любой язык
        'languages' => 'Языки', // Языки
        'training' => 'Тренировка', // Тренировка
        'statistics' => 'Статистика', // Статистика
        'favorite' => 'Избранное', // Избранное
        'search' => 'Поиск', // Поиск
        'help' => 'Помощь', // Помощь
        'start_to_find' => 'Заполните форму и нажмите Найти', // Заполните форму и нажмите Найти
        'Search_language' => 'Язык поиска', // Язык поиска
        'copyright' => 'Все права защищены', // Все права защищены
        'words' => 'Слов', // Слов
        'added' => 'Добавлено', // Добавлено
        'repeated' => 'Повторено', // Повторено
        'read' => 'Прочитано', // Прочитано
        'main' => 'Главная', // Главная
        'easy' => 'Легкий', // 'Легкий'
        'medium' => 'Срединй', // 'Срединй'
        'hard' => 'Сложный', // 'Сложный'

        'cancel' => 'Отмена', // 'Отмена'
        'delete' => 'Удалить', // 'Удалить'
        'change' => 'Изменить', // 'Изменить'
        'save' => 'Сохранить', // 'Сохранить'
        'go_editing' => 'Перейти в редактирование', // Перейти в редактирование
    ],
    'auth' => [
        'email' => 'Email', // Email
        'login' => 'Вход', // Вход
        'register' => 'Регистрация', // Регистрация
        'logout' => 'Выход из аккаунта', // Выход из аккаунта
        'forgot_pass' => 'Забыли свой пароль?', // Забыли свой пароль?
        'remember' => 'Запомнить меня', // Запомнить меня
        'password' => 'Пароль', // Пароль
        'name' => 'Имя', // Имя
        'confirmed' => 'Подтвердите пароль', // Подтвердите пароль
    ],
    'home' => [
        'success_today' => 'Успехи за сегодня', //'Успехи за сегодня'
        'phrases_added' => 'Фраз добавлено', //'Фраз добавлено'
        'new_words_added' => 'Новых слов добавлено', //'Новых слов добавлено'
        'repeated' => 'Повторено', //'Повторено'
        'read' => 'Прочитано', //'Прочитано'
        'time_to_study' => 'Времени на обучение затрачено (ч:м:с)', //'Времени на обучение затрачено (ч:м:с)'
        'hello' => 'Привет', //'Привет'
        'languageDefault' => 'У вас назначен язык по умолчанию', //'У вас назначен язык по умолчанию'
        'noLanguageDefault' => 'У вас не назначен язык по умолчанию', //'У вас не назначен язык по умолчанию'
        'changeLanguageDefault' => 'Изменить язык по умолчанию', //'Изменить язык по умолчанию'
        'setLanguageDefault' => 'Назначить язык по умолчанию', //'Назначить язык по умолчанию'
        'no_any_languages' => "У вас нет пока ни одного изучаемого языка", //'У вас нет пока ни одного изучаемого языка'
        'add_language' => "Добавить язык", //'Добавить язык'
        'set' => "Установить", //'Установить'
        'close' => "Закрыть", //'Закрыть'
        'change_and_close' => "Выберите язык и нажмите применить", //'Выберите язык и нажмите применить'
        'last_added_sections' => "Последние добавленные разделы", //'Последние добавленные разделы'
        'last_repeated_sections' => "Последние повторенные разделы", //'Последние повторенные разделы'
        'last_read_sections' => "Последние прочитанные разделы", //'Последние прочитанные разделы'
        'last_added_phrases' => "Последние добавленные фразы", //'Последние добавленные фразы'
    ],
    'languages' => [
        'add_language' => 'Добавить язык', // 'Добавить язык'
        'lang_studies' => 'Изучаемые языки', // 'Изучаемые языки'
        'add_lang' => 'Добавление изучаемого языка', // 'Добавление изучаемого языка'
        'lang_name' => 'Название языка', // 'Название языка'
        'add' => 'Добавить', // 'Добавить'
        'cancel' => 'Отмена', // 'Отмена'
        'view_fav' => 'Посмотреть избранное', // 'Посмотреть избранное'
        'add_sec' => 'Добавить раздел', // 'Добавить раздел'
    ],
    'sections' => [
        'sections' => 'Разделы', // 'Разделы'
        'add_sect' => 'Добавление раздела', // 'Добавление раздела'
        'sect_name' => 'Название раздела', // 'Название раздела'
        'comment' => 'Комментарий, описание', // 'Комментарий, описание'
        'add_sec' => 'Добавить', // 'Добавить'
        'edit' => 'Редактировать', // 'Редактировать'
        'add_edit_phrases' => 'Добавить/редактировать фразы', // 'Добавить/редактировать фразы'

        'count_cycles' => 'К-во циклов', // 'К-во циклов'
        'diff_level' => 'Уровень сложности', // 'Уровень сложности'
        'all' => 'Все', // 'Все'
        'easy' => 'Легкий', // 'Легкий'
        'medium' => 'Средний', // 'Средний'
        'hard' => 'Сложный', // 'Сложный'
        'medium_and_hard' => 'Сложный и средний', // 'Сложный и средний'
        'sorting' => 'Сортировка', // 'Сортировка'
        'in_order' => 'По порядку', // 'По порядку'
        'by_chance' => 'Случайно', // 'Случайно'
        'task' => 'Задача', // 'Задача'
        'learn' => 'Учить', // 'Учить'
        'read' => 'Читать', // 'Читать'
        'limit' => 'Лимит', // 'Лимит'

        'deselect' => 'Снять/добавить выделение у всех', // 'Снять/добавить выделение у всех'
        'select_deselect' => 'Снимает или добавляет выделение у всего раздела', // 'Снимает или добавляет выделение у всего раздела'
        'select_deselect_entire' => 'Снять/добавить выделение для всего раздела', // 'Снять/добавить выделение для всего раздела'
        'phrase_deselected' => 'Фразы, у которых снято выделение (галочка в чекбоксе) не попадают в упраждения по написанию или по чтению', // 'Фразы, у которых снято выделение (галочка в чекбоксе) не попадают в упраждения по написанию или по чтению'
        'add_selection' => 'Добавить выделение', // 'Добавить выделение'
        'deselect_all' => 'Снять выделение у всех', // 'Снять выделение у всех'
        'section_editing' => 'Редактирование раздела', // 'Редактирование раздела'
        'parent_category' => 'Родительская категория', // 'Родительская категория'
    ],
    'phrases' => [
        'adding_phrases' => 'Добавление фраз', // 'Добавление фраз'
        'adding_sec_phrases' => 'Добавление фраз раздела', // 'Добавление фраз раздела'
        'transcription' => 'Транскрипция', // 'Транскрипция'
        'native_language' => 'Родной базовый язык', // 'Родной базовый язык'
        'add' => 'Добавить', // 'Добавить'
        'back_section' => 'Вернуться в раздел', // 'Вернуться в раздел'
        'delete_all' => 'Удалить все фразы', // 'Удалить все фразы'
        'phrase_editing' => 'Редактирование фразы', // 'Редактирование фразы'
        'basis_information' => 'Основные сведения', // Основные сведения
        'added' => 'Добавлено', // Добавлено
        'changed' => 'Изменено (училось)', // Изменено (училось)
        'repeated' => 'Повторено раз', // Повторено раз
        'read' => 'Прочитано раз', // Прочитано раз
        'deleting' => 'Удаление фразы', // Удаление фразы
        'are_you_sure' => 'Вы уверены, что хотите удалить фразу', // Вы уверены, что хотите удалить фразу
        'delete_all_phrases' => 'Удаление всех фраз из раздела', // Удаление всех фраз из раздела
        'confirmed_delete' => 'Вы уверены, что хотите удалить все фразы из раздела', // Вы уверены, что хотите удалить все фразы из раздела
    ],
    'train' => [
        'home' => 'Главная', // Главная
        'train' => 'Тренировка', // Тренировка
        'language' => 'Язык', // Язык
        'selection' => 'Выборка', // Выборка
        'min' => 'Минимум повторено', // Минимум повторено
        'max' => 'Максимум повторено', // Максимум повторено
        'latest' => 'Последние', // Последние
        'first' => 'Первые', // Первые
        'rand' => 'Случайные', // Случайные
        'count' => 'Количество', // Количество
        'offset' => 'Смещение', // Смещение
        'find' => 'Найти', // Найти
        'search_results' => 'Результаты поиска', // Результаты поиска
        'exercise' => 'Упражнение', // Упражнение
        'generate' => 'Сгенерировано :count строк', // Сгененировано 40 строк
        'train_in_section' => 'Обучение по разделу', // Обучение по разделу
        'read_exercise' => 'Упражнение по чтению', // Упражнение по чтению
        'read_in_section' => 'Чтение по разделу', // Чтение по разделу
        'read_in_word' => 'Чтение по слову', // Чтение по слову
        'learn_in_word' => 'Обучение по слову', // Обучение по слову
    ],
    'dict' => [
        'new_words_to_today' => 'Новые слова за сегодня', // Новые слова за сегодня
        'all_vocabulary' => 'Весь словарный запас', // Весь словарный запас
        'count_new_words_today' => 'Сегодня добавлено новых слов', // Сегодня добавлено новых слов
        'edit_word' => 'Редактировать слово', // Редактировать слово
        'phrases_with_the_word' => 'Фразы со словом', // Фразы со словом
        'delete_word' => 'Удалить слово ', // Удалить слово
        'deleting_word' => 'Удаление слова', // Удаление слова
        'search_by_word' => 'Поиск по слову', // Поиск по слову
        'back' => 'Назад', // Назад
    ],
    'statistic' => [
        'statistic' => 'Статистика', // Статистика
        'lag_lern_stat' => 'Статистика изучения языков', // Статистика изучения языков
        'total_count_phrases' => 'Общее количество фраз', // Общее количество фраз
        'added_today' => 'Добавлено сегодня', // Добавлено сегодня
        'repeated_today' => 'Повторено сегодня', // Повторено сегодня
        'repeated' => 'Повторено раз', // Повторено раз
        'read' => 'Прочитано раз', // Прочитано раз
        'read_today' => 'Прочитано сегодня', // Прочитано сегодня
        'vocabulary' => 'Словарный запас', // Словарный запас
        'total_time' => 'Общее количество времени на изучение', // Общее количество времени на изучение
        'time_today' => 'Сегодня времени потрачено', // Сегодня времени потрачено
        'adding_new_phrases' => 'добавления новых фраз', // добавления новых фраз
        'adding_new_words' => 'добавления новых слов', // добавления новых слов
        'repetition_of_phrases' => 'повторения фраз', // повторения фраз
        'reading_of_phrases' => 'чтения фраз', // чтения фраз
        'progressive_graph' => 'Прогрессивный график :words1 за :period последних дней', // Прогрессивный график .. за .. последних дней
        'progressive_graph_time' => 'Прогрессивный график затраченного времени за :period последних дней', // Прогрессивный график затраченного времени за .. последних дней
        'graph_time' => 'График затраченного времени за :period последних дней', // График затраченного времени за .. последних дней
        'graph' => 'График :words1 за :period последних дней', // График .. за .. последних дней
        'statistic_for_period' => 'Статистика :words1 и :words2 за :period последних дней', // Статистика .. и .. за .. последних дней
        'statistic_time_for_period' => 'Статистика затраченного времени за :period последних дней', // Статистика затраченного времени за .. последних дней
        'progressive_graph_all' => 'Прогрессивный график :words1 за все время изучения', // Прогрессивный график .. за все время изучения
        'progressive_graph_time_all' => 'Прогрессивный график затраченного времени за все время изучения', // Прогрессивный график затраченного времени за все время изучения
        'graph_time_all' => 'График затраченного времени за все время изучения', // График затраченного времени за все время изучения
        'graph_all' => 'График :words1 за все время изучения', // График .. за все время изучения
        'statistic_all' => 'Статистика :words1 и :words2 за все время изучения', // Статистика .. за все время изучения
        'statistic_all_time' => 'Статистика затраченного времени за все время изучения', // Статистика затраченного времени за все время изучения
        'diagram_for_n_days' => 'График за :n дней', // График за .. дней
        'graph_repetition_and_reading' => 'График повторения и чтения', // График повторения и чтения
        'phrase_graph' => 'График фраз и слов', // График фраз и слов
        'time_spent_n' => 'Затраты времени за :n дней', // Затраты времени за n.. дней
        'for_all_time' => 'За все время', // За все время
        'more_days' => 'Еще за :n дней', // Еще за n дней
        'per_day_time' => 'В среднем в день времени', // В среднем в день времени
    ],
    'favorite' => [
        'count_lines' => 'У вас в Избранном :n предложений', // У вас в избранном 3 предложений
        'display_default' => 'В данном разделе отображаются только те предложения, которые входят в язык по умолчанию', // В данном разделе отображаются только те предложения, которые входят в язык по умолчанию
        'you_have_default' => 'У вас назначен язык по умолчанию', // У вас назначен язык по умолчанию
        'you_dont_have_default' => 'У вас не назначен язык по умолчанию', // У вас не назначен язык по умолчанию
        'you_can_change' => 'Вы можете изменить ваш язык по умолчанию', // Вы можете изменить ваш язык по умолчанию
        'set_default_lagn' => 'Назначить язык по умолчанию', // Назначить язык по умолчанию
        'clear' => 'Очистить избранное', // Очистить избранное
        'delete_all_sentence' => 'Удалить все предложения из избранного (эти фразы останутся в разделах)', // Удалить все предложения из избранного (эти фразы останутся в разделах)
        'here_can_clear' => 'Здесь вы можете очистить избранное одним кликом. Фразы будут удалены из избранного, но останутся в тех же разделах', // Здесь вы можете очистить избранное одним кликом. Фразы будут удалены из избранного, но останутся в тех же разделах
    ],
];














